-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2020-12-04 15:23:36
-- 伺服器版本： 5.7.9-log
-- PHP 版本： 7.3.13

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `i_radio`
--

-- --------------------------------------------------------

--
-- 資料表結構 `rad_author`
--

CREATE TABLE `rad_author` (
  `ra_sn` int(11) NOT NULL,
  `ra_name` varchar(20) COLLATE utf8_bin NOT NULL COMMENT '主持人姓名',
  `ra_intro` mediumtext COLLATE utf8_bin NOT NULL COMMENT '主持人簡介',
  `ra_id` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `ra_pass` varchar(36) COLLATE utf8_bin DEFAULT NULL,
  `ra_status` int(1) DEFAULT '0',
  `ra_image` varchar(20) COLLATE utf8_bin NOT NULL COMMENT '照片檔案名稱',
  `ra_sex` varchar(1) COLLATE utf8_bin NOT NULL COMMENT '性別',
  `ra_email` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `ra_old` int(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 傾印資料表的資料 `rad_author`
--

INSERT INTO `rad_author` (`ra_sn`, `ra_name`, `ra_intro`, `ra_id`, `ra_pass`, `ra_status`, `ra_image`, `ra_sex`, `ra_email`, `ra_old`) VALUES
(1, '彭依允', '可悲程式仔', 'aa', 'e10adc3949ba59abbe56e057f20f883e', 1, '1598361517.png', '男', 'wpeter89728813@gmail.com', 0),
(2, '陳勇國', '資傳程式老師', 'tyk', '827ccb0eea8a706c4c34a16891f84e7b', 1, 'a002.png', '男', NULL, 0),
(3, '張三', '路人啦', 'A3', 'c4ded2b85cc5be82fa1d2464eba9a7d3', 0, 'a003.png', '男', NULL, 0),
(4, '李四', '路人二號啦', 'A4', '827ccb0eea8a706c4c34a16891f84e7b', 0, '1598251768.png', '男', NULL, 0),
(5, '李伯', '老人', 'aaa', 'a21075a36eeddd084e17611a238c7101', 0, '1599634013.jpg', '男', NULL, 0),
(6, '吳柏學', '123456', 'qq', 'e10adc3949ba59abbe56e057f20f883e', 1, 'photoupload.jpg', '男', NULL, 1);

-- --------------------------------------------------------

--
-- 資料表結構 `rad_day`
--

CREATE TABLE `rad_day` (
  `rad_sn` int(6) NOT NULL COMMENT 'id',
  `rad_main_title` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '節目名稱',
  `rad_title` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '單元(節目)名稱',
  `rad_sammary` mediumtext COLLATE utf8_bin NOT NULL COMMENT '簡介',
  `rad_author` varchar(12) COLLATE utf8_bin NOT NULL COMMENT '主持人',
  `rad_date_broadcast` date NOT NULL COMMENT '播放日期',
  `rad_time_broadcast` time NOT NULL COMMENT '播放時間',
  `rad_end_broadcast` time NOT NULL COMMENT '結束時間',
  `rad_type` varchar(20) COLLATE utf8_bin NOT NULL COMMENT '種類',
  `rad_guest` varchar(20) COLLATE utf8_bin DEFAULT NULL COMMENT '來賓'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 傾印資料表的資料 `rad_day`
--

INSERT INTO `rad_day` (`rad_sn`, `rad_main_title`, `rad_title`, `rad_sammary`, `rad_author`, `rad_date_broadcast`, `rad_time_broadcast`, `rad_end_broadcast`, `rad_type`, `rad_guest`) VALUES
(1, '16', '國際', 'jlll', '彭依允', '2020-09-07', '00:00:00', '01:00:00', '國際', '4489'),
(2, '16', 'A2', 'AAAAA', '彭依允', '2020-09-14', '00:00:00', '01:00:00', '社會', '22'),
(3, '16', 'AAA3', 'AAADD', '彭依允', '2020-09-21', '00:00:00', '01:00:00', '社會', '333'),
(4, '16', 'AAA4', 'AAASSS', '彭依允', '2020-09-28', '00:00:00', '01:00:00', '社會', '444'),
(5, '6', 'BBB', '2135456', '彭依允', '2020-09-03', '15:00:00', '15:30:00', '遊戲', '1598'),
(6, '6', '1556520', '1984', '彭依允', '2020-09-10', '15:00:00', '15:30:00', '遊戲', 'AAAAAF'),
(7, '6', 'AADFF', 'AFAF55', '彭依允', '2020-09-17', '15:00:00', '15:30:00', '遊戲', '498441'),
(8, '6', 'AFF4949', '4FA', '彭依允', '2020-09-24', '15:00:00', '15:30:00', '遊戲', 'FFFF99'),
(9, '2', '國際1', '國際1', '彭依允', '2020-09-07', '01:30:00', '02:30:00', '國際', '鵬杯杯'),
(10, '2', '國際2', '國際2', '彭依允', '2020-09-14', '01:30:00', '02:30:00', '國際', '拋凹凹'),
(11, '2', '國際3', '國際3', '彭依允', '2020-09-21', '01:30:00', '02:30:00', '國際', '凹凹ㄆ'),
(12, '2', '國際4', '國際4', '彭依允', '2020-09-28', '01:30:00', '02:30:00', '國際', 'AD七'),
(13, '6', 'PS2', 'PS2', '彭依允', '2020-09-07', '07:00:00', '08:00:00', '遊戲', 'PS'),
(14, '6', 'XBOX', 'XBOX S', '彭依允', '2020-09-14', '07:00:00', '08:00:00', '遊戲', 'XB'),
(15, '6', 'PS4', 'PS4', '彭依允', '2020-09-21', '07:00:00', '08:00:00', '遊戲', '1122'),
(16, '6', 'PS5', 'PS5', '彭依允', '2020-09-28', '07:00:00', '08:00:00', '遊戲', '想買'),
(17, '2', '川普', 'AAAA', '彭依允', '2020-09-01', '04:00:00', '05:00:00', '國際', 'AAAA'),
(18, '2', '普丁', '俄羅斯', '彭依允', '2020-09-08', '04:00:00', '05:00:00', '國際', '普丁'),
(19, '2', '蔡英文', '台灣', '彭依允', '2020-09-15', '04:00:00', '05:00:00', '國際', '菜菜子'),
(20, '2', 'ㄚㄚㄚ', 'ㄟㄟㄟ', '彭依允', '2020-09-22', '04:00:00', '05:00:00', '國際', 'ㄋㄋㄋ'),
(21, '2', '步步', '高聲', '彭依允', '2020-09-29', '04:00:00', '05:00:00', '國際', '嗚嗚嗚'),
(22, '6', 'XBOX360', '360', '彭依允', '2020-09-02', '00:30:00', '01:30:00', '遊戲', '彭'),
(23, '6', 'XBOXS', 'XBOXS', '彭依允', '2020-09-09', '00:30:00', '01:30:00', '遊戲', 'XXX'),
(24, '6', 'XBOXX', 'XXX', '彭依允', '2020-09-16', '00:30:00', '01:30:00', '遊戲', 'DXXX'),
(25, '6', 'XBOX 360000', '36000', '彭依允', '2020-09-23', '00:30:00', '01:30:00', '遊戲', '1111'),
(26, '6', 'AAAAA', '12363666', '彭依允', '2020-09-30', '00:30:00', '01:30:00', '遊戲', '11113'),
(27, '2', 'agdag', '15848', '彭依允', '2020-09-03', '00:00:00', '00:30:00', '國際', 'PETER'),
(28, '2', 'SAFFG', 'ASGAG', '彭依允', '2020-09-10', '00:00:00', '00:30:00', '國際', '111666'),
(29, '2', 'AASGG', '64488', '彭依允', '2020-09-17', '00:00:00', '00:30:00', '國際', '錫大大'),
(30, '2', 'adddd', '七一一', '彭依允', '2020-09-24', '00:00:00', '00:30:00', '國際', '採矮'),
(31, '16', '我想睡覺', 'ZZZ', '彭依允', '2020-09-03', '04:30:00', '05:30:00', '社會', ''),
(32, '16', '我想打牌', 'AAAA', '彭依允', '2020-09-10', '04:30:00', '05:30:00', '國際', '鐵支'),
(33, '16', '我想打GAME', '上鑽囉', '彭依允', '2020-09-17', '04:30:00', '05:30:00', '遊戲', 'NTD'),
(34, '16', '4999', '4999+9+2', '彭依允', '2020-09-24', '04:30:00', '05:30:00', '國際', ''),
(35, '2', 'SSS', 'SSSSSS', '彭依允', '2020-09-06', '05:00:00', '05:30:00', '國際', 'SS'),
(36, '2', '雞雞叫', '啞啞較', '彭依允', '2020-09-13', '05:00:00', '05:30:00', '國際', '鴨'),
(37, '2', '旺旺', '垃圾', '彭依允', '2020-09-20', '05:00:00', '05:30:00', '國際', '紅梅'),
(38, '2', 'FFF', '燒毀', '彭依允', '2020-09-27', '05:00:00', '05:30:00', '國際', '我'),
(39, '16', 'cl3', 'jlll', '彭依允', '2020-10-05', '00:00:00', '01:00:00', '國際', '4489'),
(40, '16', 'ji33jjj', 'jjojoll', '彭依允', '2020-10-12', '00:00:00', '01:00:00', '政治', 'lkjojk'),
(41, '16', 'a49888', '55465', '彭依允', '2020-10-19', '00:00:00', '01:00:00', '國際', '9111'),
(42, '14', 'aaaa', '15422', '李四', '2020-09-02', '02:00:00', '03:00:00', '國際', '6622'),
(43, '14', '955', 'qqfgg', '李四', '2020-09-09', '02:00:00', '03:00:00', '國際', '2596'),
(44, '14', '15969', 'qfggq', '李四', '2020-09-16', '02:00:00', '03:00:00', '國際', 'qeegg'),
(45, '14', 'aqag4', '892115', '李四', '2020-09-23', '02:00:00', '03:00:00', '國際', '6954'),
(46, '14', 'saff41', '1965', '李四', '2020-09-30', '02:00:00', '03:00:00', '政治', '654'),
(47, '2', '歐歐歐', '凹凹凹', '彭依允', '2020-10-05', '09:00:00', '10:00:00', '國際', '5566'),
(48, '2', 'ㄇㄇㄇ', '痾痾痾', '彭依允', '2020-10-12', '09:00:00', '10:00:00', '國際', '8899'),
(49, '2', '悶恩恩', '窩屋喔', '彭依允', '2020-10-19', '09:00:00', '10:00:00', '國際', '123'),
(50, '2', '我我我', '你你', '彭依允', '2020-10-26', '09:00:00', '10:00:00', '國際', '8877');

-- --------------------------------------------------------

--
-- 資料表結構 `rad_form`
--

CREATE TABLE `rad_form` (
  `rad_sn` int(6) NOT NULL COMMENT 'id',
  `rad_main_title` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '節目名稱',
  `rad_title` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '單元(節目)名稱',
  `rad_sammary` mediumtext COLLATE utf8_bin NOT NULL COMMENT '簡介',
  `rad_filename` varchar(225) COLLATE utf8_bin NOT NULL COMMENT '檔案名稱',
  `rad_author` varchar(12) COLLATE utf8_bin NOT NULL COMMENT '主持人',
  `rad_date_broadcast` date NOT NULL COMMENT '播放日期',
  `rad_time_broadcast` time NOT NULL COMMENT '播放時間',
  `rad_end_broadcast` time NOT NULL COMMENT '結束時間',
  `rad_type` varchar(20) COLLATE utf8_bin NOT NULL COMMENT '種類',
  `rad_guest` varchar(20) COLLATE utf8_bin DEFAULT NULL COMMENT '來賓',
  `rad_broad_no` int(6) DEFAULT NULL COMMENT '點擊次數',
  `rad_like` int(6) DEFAULT NULL COMMENT 'like次數',
  `rad_unlike` int(6) DEFAULT NULL COMMENT 'unlike數',
  `rad_del` int(1) DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 傾印資料表的資料 `rad_form`
--

INSERT INTO `rad_form` (`rad_sn`, `rad_main_title`, `rad_title`, `rad_sammary`, `rad_filename`, `rad_author`, `rad_date_broadcast`, `rad_time_broadcast`, `rad_end_broadcast`, `rad_type`, `rad_guest`, `rad_broad_no`, `rad_like`, `rad_unlike`, `rad_del`) VALUES
(1, '1', '美國新聞1', '美方21日突然要求中方關閉駐休士頓總領館，中國外交部發言人汪文斌今天表示，強烈譴責並敦促美方立即撤銷有關錯誤決定。隨後中國駐休士頓領事館於當地時間21日晚間傳出火警，領事館人員疑似在庭院將大量文件放進垃圾桶焚燒。美國國務院今天回應，下令關閉是為了保護美國的智慧財產與個人資料。', '美國新聞', '彭依允', '2020-08-20', '21:27:10', '22:51:45', '國際', '彭二允', NULL, NULL, NULL, 1),
(2, '1', '台灣民眾黨參選高雄市長', '代表台灣民眾黨參選高雄市長補選的高雄市議員吳益政透露，前高雄市副市長李四川曾經透露，他在高雄鋪路，廠商都是原來的，價格也都一樣！', '台灣新聞', '彭依允', '2020-08-10', '21:27:10', '23:51:45', '政治', '彭二允', NULL, NULL, NULL, 1),
(3, '1', '高雄鋪路', '至於她涉抄襲的二篇文章，複製貼上篇幅最多的，是台北大學公共行政暨政策學系碩士生雷政儒在2000年7月出版的論文兩岸經貿互動與台商投資之演變分析，本刊統計，李眉蓁論文本文123頁中，有高達96%的頁數都涉抄自這本。', '本土新聞2', '彭依允', '2020-08-11', '21:31:14', '22:51:45', '政治', '彭二允', NULL, NULL, NULL, 1),
(4, '2', '中國宣布關閉美國駐成都領事館', '美國21日突然下達通知，要求中國駐休士頓總領事館3天內關閉，以保護美國人民知識產權和個人訊息。中國今日通知美國駐華使館，中方決定撤銷對美國駐成都總領事館的設立和運行許可，並對該總領事館停止一切業務和活動提出具體要求。', 'cn1', '彭依允', '2020-08-11', '12:33:11', '17:18:22', '國際', NULL, NULL, NULL, NULL, 0),
(5, '3', '李眉蓁欲放棄學位', '國民黨高雄市長補選參選人李眉蓁涉論文抄襲，她23日出面致歉，宣布放棄國立中山大學在職碩士班學位，並會申請刪除選舉公報內的這項學歷。中山大學回應，依現行學位授予法規定取得的學位，無自行放棄規範', 'political01', '陳勇國', '2020-08-12', '12:33:11', '15:35:22', '政治', NULL, NULL, NULL, NULL, 0),
(6, '4', '威力彩「電腦選號」是內定不中獎號碼？', '威力彩連摃頭獎直飆25億元，成為全台熱門話題，日前網傳電腦選號是送錢給彩券行，對此，台灣彩券推翻民間說法表示，第四屆彩券自103年1月1日起，威力彩頭獎中獎者電腦選號比例是70%，近6年來幸運中頭獎的電選與自選比例約為7：3。', 'money1', '陳勇國', '2020-08-12', '12:37:08', '15:55:22', '社會', NULL, NULL, NULL, NULL, 0),
(7, '4', '政院拍板紓困3.0預算 產業薪資補貼到第4季', '行政院長蘇貞昌今天主持院會，通過「紓困3.0」武漢肺炎（新型冠狀病毒病，COVID-19）特別預算的第2次追加預算，共編列2100億元，全數以舉債支應，各部會編列的預算，以經濟部編列3倍券、受衝擊產業薪資補貼等1300多億元最多，有關對經濟部主管的製造業、貿易服務業、會展產業，以及交通部主管對觀光業等艱困企業的員工薪資補貼與營運資金補貼，都從今年第3季編列到第4季，也就是從7月起補助到12月底。', 'covid1', '陳勇國', '2020-08-13', '12:41:05', '17:55:22', '社會', NULL, NULL, NULL, NULL, 0),
(8, '2', '美新冠確診破400萬！譚德塞：再也回不到過去生活 反駁中國收買論', '週四 (23 日) 美國新冠疫情持續蔓延，累計確診已超過 400 萬，世衛組織警告，隨著在美國和貧窮發展中國家疫情惡化，人們已無法回到過去的生活。全球新冠肺炎 (COVID-19) 疫情持續蔓延，截稿前，據美國約翰霍普金斯大學 (Johns Hopkins University) 即時統計，全球確診數已飆破 1530 萬例，死亡數突破 62.5 萬例', 'int1', '彭依允', '2020-08-13', '12:42:14', '15:54:17', '國際', NULL, NULL, NULL, NULL, 0),
(9, '1', 'Adobe緊急修補Photoshop的重大安全漏洞', 'Adobe在7月21日釋出緊急安全更新，修補13個安全漏洞，其中5個存在於Photoshop，皆可造成任意程式執行，同時波及Windows與macOS平臺', 'AD1', '彭依允', '2020-08-13', '12:42:14', '19:54:17', '頭條', NULL, NULL, NULL, NULL, 1),
(10, '6', '全球領看門狗2中國卻收到光明之子育碧道歉玩家更怒了', 'Ubisoft Forward線上發表會在上週 13 號舉行，原本觀看直播的玩家可獲得免費《看門狗2》，結果系統大爆炸玩家領不了，後續育碧直接大放送，乾脆開放全球玩家都能領。不過就當全球玩家歡天喜地領《看門狗2》的同時，中國玩家卻發現他們收到的遊戲竟然變成《光明之子》，許多玩家也前往官方微博怒噴育碧「差別對待」、「把中國人當猴子耍」，並要求育碧出面給個交代。\r\n\r\n', 'gm1', '彭依允', '2020-08-14', '12:42:14', '16:54:17', '遊戲', NULL, NULL, NULL, NULL, 0),
(11, '3', '李眉蓁指導教授身分曝光！　名嘴起底過去角色：論文放水有深意', '高雄市長補選候選人李眉蓁23日上午為碩士論文抄襲一事鞠躬道歉，並表示要放棄中山大學碩士學位，為爭議止血。對此，政治評論員、名嘴溫朗東今（24）日清晨發文，稱李眉蓁的論文指導教授林德昌曾任國民黨中央委員，是標準的統派學者。', 'po2', '陳勇國', '2020-08-14', '12:48:05', '21:54:17', '政治', '彭二允', NULL, NULL, NULL, 0),
(12, '2', '美戰機在敘利亞飛近 伊朗客機急降數人受傷', '伊朗媒體報導，美國戰機今天在敘利亞上空飛近一架伊朗客機，迫使這架客機緊急改變飛行高度以防撞上，造成數名乘客受傷。', 'int3', '彭依允', '2020-08-15', '12:49:30', '14:54:17', '國際', NULL, NULL, NULL, NULL, 0),
(13, '2', '白宮上演甩鍋大秀！ 川普認：太早重開疫情升溫', '美國確診逼近400萬人大關！川普這兩天態度大大改變，不但要大家趕快買口罩來戴，也終於坦言，各州太早重開，才會導致疫情升溫。不過白宮現在忙著甩鍋，暗示重啟經濟，都是州政府的決定，試圖跟川普切割。美國也宣布，他們已經砸下近20億美元，預購1億劑的疫苗，人人可免費施打。', 'int4', '彭依允', '2020-08-21', '12:49:30', '15:54:17', '國際', NULL, NULL, NULL, NULL, 0),
(21, '2', '大砲老轟習近平 「紅二代」任志強被控涉貪移送法辦', '中共北京市西城區紀委區監委23日晚間指稱，69歲的房地產大亨北京市華遠集團董事長任志強，因涉嫌嚴重違紀、違法問題，被開除黨籍，並已被立案審查調查，移送檢察機關依法審查起訴。', 'int4', '彭依允', '2020-08-22', '12:56:47', '17:54:17', '國際', NULL, NULL, NULL, NULL, 0),
(22, '5', '聯電接棒台積電 苦等12年大解套', '半導體族群野火燒不盡，野村證券升評聯電至買進，認為轉強題材遭嚴重低估，給予25元推測合理股價，激勵股價衝上12年新高、迎鼠年大解套；摩根大通證券初次將世界納入研究範圍，給予優於大盤投資評等，二線晶圓代工攜手接棒台積電、喜迎多頭行情。', '1598448653.mp3', '彭依允', '2020-08-22', '12:57:57', '18:53:12', '經濟', '', NULL, NULL, NULL, 0),
(23, '5', '澎湖太夯安心旅遊補助預計7月底用光？觀光局這樣說', '安心旅遊補助7月上路至今短短24天，因適逢暑假期間，加上振興券加持，國旅大爆炸，其中又以澎湖還有花火節助陣，補助預算用得最快。澎湖縣政府旅遊處今天說，三批4000萬、共1.2億預算將在7月底用光，會持續爭取補助。', 'sh1', '陳勇國', '2020-08-22', '15:11:29', '20:53:12', '社會', NULL, NULL, NULL, NULL, 0),
(24, '3', '李眉蓁論文96％抄他 網傳雷政儒現況曝光！同事回應了', '國民黨高雄市長候選人李眉蓁，因論文抄襲宣布放棄中山大學碩士學位，但被抄了96%論文內容的苦主雷政儒，卻始終低調未現身、未回應，自稱是雷政儒同事的網友則在網路上爆料，曝光他的真實身份', 'po3', '陳勇國', '2020-08-23', '17:11:29', '21:59:12', '政治', '彭二允', NULL, NULL, NULL, 0),
(25, '2', '美媒再爆：中國領事館涉嫌使用假身分', '美國媒體最近爆料，中國駐休士頓總領事的工作人員，曾經使用過假身份來護送中國旅客到機場！而中國外交部也隨即駁斥，表示當時使用的是美國國務院批准的特殊證件。\r\n\r\n', 'int7', '彭依允', '2020-08-23', '17:14:31', '19:53:12', '國際', NULL, NULL, NULL, NULL, 0),
(26, '3', '謝和弦宣布退出民眾黨！ 自曝入黨只為學姐', '歌手謝和弦過去曾力挺柯文哲選台北市長，後來加入台灣民眾黨，成為創黨黨員，即使後來捲入吸毒、出軌風波，也依然是話題人物。近來，他在臉書發文跟上放棄大賽，宣布自己退出民眾黨，更自曝入黨原因只為學姐。', 'po4', '陳勇國', '2020-08-24', '17:14:31', '20:53:12', '政治', NULL, NULL, NULL, NULL, 0),
(27, '3', '李眉蓁欲刪除選舉公報學歷註記 中選會:於法無據', '國民黨籍高雄市長補選候選人李眉蓁近日陷入碩士論文抄襲風波，對於她表示將申請刪除選舉公報上的碩士學歷註記，中選會副主委陳朝建今表示，選舉公報上的政見或學經歷等資料，均以其參選登記截止日為準，超過截止日後，候選人請求選務機關重新編印或註記其學歷，均於法無據。', 'po8', '陳勇國', '2020-08-24', '17:18:09', '21:53:13', '政治', '彭瀛洲', NULL, NULL, NULL, 0),
(28, '3', '蔡總統促執政團隊深自警惕', '總統蔡英文今天回應有關立委涉及收賄事件，提醒所有執政團隊升官發財，請走別路，執政目標不是為自己利益，是為讓台灣更好；切勿因一時疏忽，砸掉人民的信任。', 'A0809', '陳勇國', '2020-08-24', '10:36:40', '14:53:12', '政治', NULL, NULL, NULL, NULL, 0),
(29, '3', '立委護航SOGO條款涉收賄', '台北地檢署查出太流前董座李恆隆為爭Sogo經營權，涉透過白手套行賄民進黨籍立委蘇震清等4名立委、時代力量前黨主席徐永明，涉犯貪汙罪。據悉，全案緣於4年前一封寄到北檢檢察長信箱的匿名檢舉信，檢調鎖定關鍵人物白手套郭克銘、立委廖國棟辦公室主任丁復華等人監聽跟監後，案情逐漸明朗。', 'a1111', '陳勇國', '2020-08-24', '10:00:00', '12:00:00', '政治', NULL, NULL, NULL, NULL, 0),
(30, '3', '專家說破嘴就是不入境普篩', '台灣為何就是不做普篩？不少公衛專家、醫界人士建議對入境人士一律普篩，卻屢被指揮中心打回票。', 'a22', '陳勇國', '2020-08-24', '10:00:00', '15:54:17', '政治', NULL, NULL, NULL, NULL, 0),
(31, '3', '蔡總統親上火線', '蔡英文總統親上火線，下午14時30分將在總統府舉行記者會，回應立委收賄案。', 'A333', '陳勇國', '2020-08-24', '12:00:00', '15:00:00', '政治', NULL, NULL, NULL, NULL, 0),
(34, '14', '我懶得上班', '我懶得要死', '10 sec countdown best free no copyright music.mp3', '李四', '2020-08-26', '18:00:00', '00:00:00', '社會', '', NULL, NULL, NULL, 0),
(33, '1', '我不想上課啦啦啦', '我好懶喔', '1598448428.mp3', '彭依允', '2020-08-26', '21:30:00', '22:00:00', '社會', '彭三允', NULL, NULL, NULL, 1),
(35, '15', '睡覺', '睡飽吃吃飽睡', '10 sec countdown best free no copyright music.mp3', '李四', '2020-08-26', '20:23:00', '00:00:00', '社會', '', NULL, NULL, NULL, 0),
(36, '5', '疫情影響經濟', '安倍在自民黨內所屬派系細田派（清和政策研究會）會長、前自民黨幹事長細田博之今天受訪時說，安倍有打電話給他表示要辭職，讓人惋惜，但既然健康惡化，這也是沒有辦法的事。安倍8月16日到18日休假3天，幾乎都在自家中度過，但17日前往慶應大學附設醫院接受檢查，停留約7個半小時。', '10 sec countdown best free no copyright music.mp3', '彭依允', '2020-08-28', '17:00:00', '00:00:00', '經濟', '', NULL, NULL, NULL, 0),
(37, '16', '館長中槍', '知名網紅「館長」陳之漢今天凌晨2時許在自家健身中心「成吉思汗健身俱樂部林口旗艦店」門口遭人開三槍，館長右手臂與右大腿、右腳踝中彈。', '10 sec countdown best free no copyright music.mp3', '彭依允', '2020-08-28', '15:00:00', '00:00:00', '社會', '', NULL, NULL, NULL, 0),
(38, '2', '豬肉進口', '總統蔡英文、行政院長蘇貞昌今中午在台北賓館邀宴民進黨團立委，據了解，行政團隊在會中宣布，政府經嚴謹風險評估，決定開放萊克多巴胺豬肉及30月齡以上的美國牛肉進口。行政部門有備而來，準備好問答集、圖卡盼爭取立委認同，希望他們協助向民眾說明。蔡英文下午3點半親自開記者會說明。', '10 sec countdown best free no copyright music.mp3', '彭依允', '2020-08-27', '15:00:00', '00:00:00', '經濟', '', NULL, NULL, NULL, 0),
(39, '2', '川普獨裁', '賀錦麗批川普唯我獨尊 川普指NBA罷賽已成政治組織\r\n', '10 sec countdown best free no copyright music.mp3', '彭依允', '2020-08-28', '18:00:00', '00:00:00', '國際', '', NULL, NULL, NULL, 0),
(41, '2', 'AA', '12345', '', '彭依允', '2020-08-30', '12:00:00', '00:00:00', '', '', NULL, NULL, NULL, 0);

-- --------------------------------------------------------

--
-- 資料表結構 `rad_prog`
--

CREATE TABLE `rad_prog` (
  `rp_sn` int(6) NOT NULL COMMENT 'RP序號',
  `rp_name` varchar(20) COLLATE utf8_bin NOT NULL COMMENT '節目名稱',
  `rp_user_id` varchar(20) COLLATE utf8_bin DEFAULT NULL COMMENT '使用者ID',
  `rp_public` int(1) NOT NULL DEFAULT '0' COMMENT '是否公開',
  `rp_old` int(1) NOT NULL DEFAULT '0' COMMENT '以下檔'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 傾印資料表的資料 `rad_prog`
--

INSERT INTO `rad_prog` (`rp_sn`, `rp_name`, `rp_user_id`, `rp_public`, `rp_old`) VALUES
(1, '頭條新聞', '1', 0, 1),
(2, '國際新聞', '1', 1, 0),
(3, '政治新聞', '2', 1, 0),
(4, '社會新聞', '2', 1, 0),
(5, '經濟新聞', '1', 1, 0),
(6, '遊戲新聞', '1', 1, 0),
(11, '特別節目', '2', 1, 0),
(12, '台語新聞', '1', 1, 1),
(13, '葛格不要', '3', 1, 0),
(14, '我不要上班', '4', 1, 0),
(15, '好懶得起床', '4', 1, 0),
(16, '台灣新鮮事', '1', 1, 0);

-- --------------------------------------------------------

--
-- 資料表結構 `rad_timetable`
--

CREATE TABLE `rad_timetable` (
  `rt_sn` int(6) NOT NULL COMMENT '序號',
  `rt_grid` varchar(6) COLLATE utf8_bin NOT NULL COMMENT '座標位置',
  `rt_time` time NOT NULL COMMENT '時程',
  `rt_day` varchar(1) COLLATE utf8_bin NOT NULL COMMENT '星期',
  `rt_author` varchar(2) COLLATE utf8_bin DEFAULT NULL,
  `rt_prog` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `rt_oc` varchar(1) COLLATE utf8_bin NOT NULL DEFAULT '0',
  `rt_relate` int(1) DEFAULT NULL,
  `rt_child` int(1) NOT NULL DEFAULT '0',
  `rt_add_new` int(1) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 傾印資料表的資料 `rad_timetable`
--

INSERT INTO `rad_timetable` (`rt_sn`, `rt_grid`, `rt_time`, `rt_day`, `rt_author`, `rt_prog`, `rt_oc`, `rt_relate`, `rt_child`, `rt_add_new`) VALUES
(1, '1-1', '00:00:00', '1', '1', '台灣新鮮事', '1', 8, 0, 1),
(2, '1-2', '00:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(3, '1-3', '00:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(4, '1-4', '00:00:00', '4', '1', '國際新聞', '1', NULL, 0, 1),
(5, '1-5', '00:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(6, '1-6', '00:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(7, '1-7', '00:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(8, '2-1', '00:30:00', '1', '1', '台灣新鮮事', '1', 1, 1, 0),
(9, '2-2', '00:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(10, '2-3', '00:30:00', '3', '1', '遊戲新聞', '1', 17, 0, 1),
(11, '2-4', '00:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(12, '2-5', '00:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(13, '2-6', '00:30:00', '6', '2', '經濟新聞', '1', NULL, 0, 0),
(14, '2-7', '00:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(15, '3-1', '01:00:00', '1', '', '', '0', NULL, 0, 0),
(16, '3-2', '01:00:00', '2', ' ', ' ', '0', NULL, 0, 0),
(17, '3-3', '01:00:00', '3', '1', '國際新聞', '1', 10, 1, 0),
(18, '3-4', '01:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(19, '3-5', '01:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(20, '3-6', '01:00:00', '6', '2', '經濟新聞', '1', NULL, 0, 0),
(21, '3-7', '01:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(22, '4-1', '01:30:00', '1', '1', '國際新聞', '1', 29, 0, 1),
(23, '4-2', '01:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(24, '4-3', '01:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(25, '4-4', '01:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(26, '4-5', '01:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(27, '4-6', '01:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(28, '4-7', '01:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(29, '5-1', '02:00:00', '1', '1', '國際新聞', '1', 22, 1, 0),
(30, '5-2', '02:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(31, '5-3', '02:00:00', '3', '4', '我不要上班', '1', 38, 0, 1),
(32, '5-4', '02:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(33, '5-5', '02:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(34, '5-6', '02:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(35, '5-7', '02:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(36, '6-1', '02:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(37, '6-2', '02:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(38, '6-3', '02:30:00', '3', '4', '我不要上班', '1', 31, 1, 0),
(39, '6-4', '02:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(40, '6-5', '02:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(41, '6-6', '02:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(42, '6-7', '02:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(43, '7-1', '03:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(44, '7-2', '03:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(45, '7-3', '03:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(46, '7-4', '03:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(47, '7-5', '03:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(48, '7-6', '03:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(49, '7-7', '03:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(50, '8-1', '03:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(51, '8-2', '03:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(52, '8-3', '03:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(53, '8-4', '03:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(54, '8-5', '03:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(55, '8-6', '03:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(56, '8-7', '03:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(57, '9-1', '04:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(58, '9-2', '04:00:00', '2', '1', '國際新聞', '1', 65, 0, 1),
(59, '9-3', '04:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(60, '9-4', '04:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(61, '9-5', '04:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(62, '9-6', '04:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(63, '9-7', '04:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(64, '10-1', '04:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(65, '10-2', '04:30:00', '2', '1', '國際新聞', '1', 58, 1, 0),
(66, '10-3', '04:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(67, '10-4', '04:30:00', '4', '1', '台灣新鮮事', '1', 74, 0, 1),
(68, '10-5', '04:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(69, '10-6', '04:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(70, '10-7', '04:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(71, '11-1', '05:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(72, '11-2', '05:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(73, '11-3', '05:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(74, '11-4', '05:00:00', '4', '1', '台灣新鮮事', '1', 67, 1, 0),
(75, '11-5', '05:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(76, '11-6', '05:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(77, '11-7', '05:00:00', '7', '1', '國際新聞', '1', NULL, 0, 1),
(78, '12-1', '05:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(79, '12-2', '05:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(80, '12-3', '05:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(81, '12-4', '05:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(82, '12-5', '05:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(83, '12-6', '05:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(84, '12-7', '05:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(85, '13-1', '06:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(86, '13-2', '06:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(87, '13-3', '06:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(88, '13-4', '06:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(89, '13-5', '06:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(90, '13-6', '06:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(91, '13-7', '06:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(92, '14-1', '06:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(93, '14-2', '06:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(94, '14-3', '06:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(95, '14-4', '06:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(96, '14-5', '06:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(97, '14-6', '06:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(98, '14-7', '06:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(99, '15-1', '07:00:00', '1', '1', '遊戲新聞', '1', 106, 0, 1),
(100, '15-2', '07:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(101, '15-3', '07:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(102, '15-4', '07:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(103, '15-5', '07:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(104, '15-6', '07:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(105, '15-7', '07:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(106, '16-1', '07:30:00', '1', '1', '遊戲新聞', '1', 99, 1, 0),
(107, '16-2', '07:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(108, '16-3', '07:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(109, '16-4', '07:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(110, '16-5', '07:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(111, '16-6', '07:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(112, '16-7', '07:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(113, '17-1', '08:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(114, '17-2', '08:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(115, '17-3', '08:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(116, '17-4', '08:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(117, '17-5', '08:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(118, '17-6', '08:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(119, '17-7', '08:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(120, '18-1', '08:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(121, '18-2', '08:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(122, '18-3', '08:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(123, '18-4', '08:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(124, '18-5', '08:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(125, '18-6', '08:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(126, '18-7', '08:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(127, '19-1', '09:00:00', '1', '1', '國際新聞', '1', 134, 0, 1),
(128, '19-2', '09:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(129, '19-3', '09:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(130, '19-4', '09:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(131, '19-5', '09:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(132, '19-6', '09:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(133, '19-7', '09:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(134, '20-1', '09:30:00', '1', '1', '國際新聞', '1', 127, 1, 0),
(135, '20-2', '09:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(136, '20-3', '09:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(137, '20-4', '09:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(138, '20-5', '09:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(139, '20-6', '09:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(140, '20-7', '09:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(141, '21-1', '10:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(142, '21-2', '10:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(143, '21-3', '10:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(144, '21-4', '10:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(145, '21-5', '10:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(146, '21-6', '10:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(147, '21-7', '10:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(148, '22-1', '10:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(149, '22-2', '10:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(150, '22-3', '10:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(151, '22-4', '10:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(152, '22-5', '10:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(153, '22-6', '10:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(154, '22-7', '10:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(155, '23-1', '11:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(156, '23-2', '11:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(157, '23-3', '11:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(158, '23-4', '11:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(159, '23-5', '11:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(160, '23-6', '11:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(161, '23-7', '11:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(162, '24-1', '11:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(163, '24-2', '11:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(164, '24-3', '11:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(165, '24-4', '11:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(166, '24-5', '11:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(167, '24-6', '11:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(168, '24-7', '11:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(169, '25-1', '12:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(170, '25-2', '12:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(171, '25-3', '12:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(172, '25-4', '12:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(173, '25-5', '12:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(174, '25-6', '12:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(175, '25-7', '12:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(176, '26-1', '12:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(177, '26-2', '12:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(178, '26-3', '12:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(179, '26-4', '12:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(180, '26-5', '12:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(181, '26-6', '12:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(182, '26-7', '12:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(183, '27-1', '13:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(184, '27-2', '13:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(185, '27-3', '13:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(186, '27-4', '13:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(187, '27-5', '13:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(188, '27-6', '13:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(189, '27-7', '13:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(190, '28-1', '13:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(191, '28-2', '13:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(192, '28-3', '13:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(193, '28-4', '13:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(194, '28-5', '13:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(195, '28-6', '13:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(196, '28-7', '13:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(197, '29-1', '14:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(198, '29-2', '14:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(199, '29-3', '14:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(200, '29-4', '14:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(201, '29-5', '14:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(202, '29-6', '14:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(203, '29-7', '14:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(204, '30-1', '14:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(205, '30-2', '14:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(206, '30-3', '14:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(207, '30-4', '14:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(208, '30-5', '14:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(209, '30-6', '14:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(210, '30-7', '14:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(211, '31-1', '15:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(212, '31-2', '15:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(213, '31-3', '15:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(214, '31-4', '15:00:00', '4', '1', '遊戲新聞', '1', NULL, 0, 1),
(215, '31-5', '15:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(216, '31-6', '15:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(217, '31-7', '15:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(218, '32-1', '15:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(219, '32-2', '15:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(220, '32-3', '15:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(221, '32-4', '15:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(222, '32-5', '15:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(223, '32-6', '15:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(224, '32-7', '15:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(225, '33-1', '16:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(226, '33-2', '16:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(227, '33-3', '16:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(228, '33-4', '16:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(229, '33-5', '16:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(230, '33-6', '16:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(231, '33-7', '16:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(232, '34-1', '16:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(233, '34-2', '16:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(234, '34-3', '16:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(235, '34-4', '16:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(236, '34-5', '16:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(237, '34-6', '16:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(238, '34-7', '16:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(239, '35-1', '17:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(240, '35-2', '17:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(241, '35-3', '17:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(242, '35-4', '17:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(243, '35-5', '17:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(244, '35-6', '17:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(245, '35-7', '17:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(246, '36-1', '17:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(247, '36-2', '17:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(248, '36-3', '17:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(249, '36-4', '17:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(250, '36-5', '17:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(251, '36-6', '17:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(252, '36-7', '17:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(253, '37-1', '18:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(254, '37-2', '18:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(255, '37-3', '18:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(256, '37-4', '18:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(257, '37-5', '18:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(258, '37-6', '18:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(259, '37-7', '18:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(260, '38-1', '18:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(261, '38-2', '18:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(262, '38-3', '18:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(263, '38-4', '18:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(264, '38-5', '18:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(265, '38-6', '18:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(266, '38-7', '18:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(267, '39-1', '19:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(268, '39-2', '19:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(269, '39-3', '19:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(270, '39-4', '19:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(271, '39-5', '19:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(272, '39-6', '19:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(273, '39-7', '19:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(274, '40-1', '19:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(275, '40-2', '19:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(276, '40-3', '19:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(277, '40-4', '19:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(278, '40-5', '19:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(279, '40-6', '19:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(280, '40-7', '19:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(281, '41-1', '20:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(282, '41-2', '20:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(283, '41-3', '20:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(284, '41-4', '20:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(285, '41-5', '20:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(286, '41-6', '20:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(287, '41-7', '20:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(288, '42-1', '20:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(289, '42-2', '20:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(290, '42-3', '20:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(291, '42-4', '20:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(292, '42-5', '20:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(293, '42-6', '20:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(294, '42-7', '20:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(295, '43-1', '21:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(296, '43-2', '21:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(297, '43-3', '21:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(298, '43-4', '21:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(299, '43-5', '21:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(300, '43-6', '21:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(301, '43-7', '21:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(302, '44-1', '21:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(303, '44-2', '21:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(304, '44-3', '21:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(305, '44-4', '21:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(306, '44-5', '21:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(307, '44-6', '21:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(308, '44-7', '21:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(309, '45-1', '22:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(310, '45-2', '22:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(311, '45-3', '22:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(312, '45-4', '22:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(313, '45-5', '22:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(314, '45-6', '22:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(315, '45-7', '22:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(316, '46-1', '22:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(317, '46-2', '22:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(318, '46-3', '22:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(319, '46-4', '22:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(320, '46-5', '22:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(321, '46-6', '22:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(322, '46-7', '22:30:00', '7', NULL, NULL, '0', NULL, 0, 0),
(323, '47-1', '23:00:00', '1', NULL, NULL, '0', NULL, 0, 0),
(324, '47-2', '23:00:00', '2', NULL, NULL, '0', NULL, 0, 0),
(325, '47-3', '23:00:00', '3', NULL, NULL, '0', NULL, 0, 0),
(326, '47-4', '23:00:00', '4', NULL, NULL, '0', NULL, 0, 0),
(327, '47-5', '23:00:00', '5', NULL, NULL, '0', NULL, 0, 0),
(328, '47-6', '23:00:00', '6', NULL, NULL, '0', NULL, 0, 0),
(329, '47-7', '23:00:00', '7', NULL, NULL, '0', NULL, 0, 0),
(330, '48-1', '23:30:00', '1', NULL, NULL, '0', NULL, 0, 0),
(331, '48-2', '23:30:00', '2', NULL, NULL, '0', NULL, 0, 0),
(332, '48-3', '23:30:00', '3', NULL, NULL, '0', NULL, 0, 0),
(333, '48-4', '23:30:00', '4', NULL, NULL, '0', NULL, 0, 0),
(334, '48-5', '23:30:00', '5', NULL, NULL, '0', NULL, 0, 0),
(335, '48-6', '23:30:00', '6', NULL, NULL, '0', NULL, 0, 0),
(336, '48-7', '23:30:00', '7', NULL, NULL, '0', NULL, 0, 0);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `rad_author`
--
ALTER TABLE `rad_author`
  ADD PRIMARY KEY (`ra_sn`);

--
-- 資料表索引 `rad_day`
--
ALTER TABLE `rad_day`
  ADD PRIMARY KEY (`rad_sn`);

--
-- 資料表索引 `rad_form`
--
ALTER TABLE `rad_form`
  ADD PRIMARY KEY (`rad_sn`);

--
-- 資料表索引 `rad_prog`
--
ALTER TABLE `rad_prog`
  ADD PRIMARY KEY (`rp_sn`);

--
-- 資料表索引 `rad_timetable`
--
ALTER TABLE `rad_timetable`
  ADD PRIMARY KEY (`rt_sn`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `rad_author`
--
ALTER TABLE `rad_author`
  MODIFY `ra_sn` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `rad_day`
--
ALTER TABLE `rad_day`
  MODIFY `rad_sn` int(6) NOT NULL AUTO_INCREMENT COMMENT 'id', AUTO_INCREMENT=51;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `rad_form`
--
ALTER TABLE `rad_form`
  MODIFY `rad_sn` int(6) NOT NULL AUTO_INCREMENT COMMENT 'id', AUTO_INCREMENT=42;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `rad_prog`
--
ALTER TABLE `rad_prog`
  MODIFY `rp_sn` int(6) NOT NULL AUTO_INCREMENT COMMENT 'RP序號', AUTO_INCREMENT=17;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `rad_timetable`
--
ALTER TABLE `rad_timetable`
  MODIFY `rt_sn` int(6) NOT NULL AUTO_INCREMENT COMMENT '序號', AUTO_INCREMENT=337;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
